<?php

$music_list = [
    
    
    '魔法使いの弟子'=>'',
    'パート・オブ・ユア・ワールド'=>'',
    
       
    
    
    
    
    
    'くまのプーさん'=>'',
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
];
$rand_key = array_rand($music_list, 5);
print_r($rand_key);
?>
"""
未開放曲
'ミニーのユー・フー！',
'キス・ザ・ガール',
'哀れな人々',
'アラビアン・ナイト',
'アリ王子のお通り',
'これが恋かしら',
'仕事のうた/夢はひそかに',
'バラを赤く塗ろう',
'誰がバラを赤く塗った?',
'アロハ・エ・コモ・マイ(カバー)',
'おとなになったら',
'ひとりぼっちの晩餐会',
'強いぞ、ガストン',
'きみもとべるよ！',
'フック船長はエレガント',
'輝く未来',
'誰にでも夢はある',
'サークル・オブ・ライフ',
'愛を感じて',
'いつか夢で',
'ウッディのラウンドアップ',

'星に願いを'
前回の配信でプレイ
'エレクトリカル パレードのテーマ',
'ミッキーマウス・マーチ'=>'',
'アンダー・ザ・シー',
'ホール・ニュー・ワールド',
'フレンド・ライク・ミー'=>'',
'夢はひそかに',
'ビビディ・バビディ・ブー',
'ふしぎの国のアリス',
'お誕生日じゃない日のうた',
'時間におくれた',
'レット・イット・ゴー～ありのままで～',
'イントゥ・ジ・アンノウン～心のままに',
'ワンダフル・シング・アバウト・ティガー',
'ズオウとヒイタチ',
'おなかグーグー',
'右から2番目の星',
'リーダーにつづけ',
'自由への扉',
'いつか王子様が',
'ハイ・ホー'=>'',
'小人たちのヨーデル',
'ハワイアン・ローラーコースター・ライド',
'アロハ・エ・コモ・マイ',
'朝の風景',
'美女と野獣',
'リフレクション',
'トゥルー･トゥ･ユア･ハート',
'闘志を燃やせ',
'ハクナ・マタタ',
'私は不思議'=>'',
'君はともだち',
'君がいないと',
'絶叫フロア',
'ハイ・ディドゥル・ディー・ディー'=>'',
'ディズニー ミュージックパレード・ゲームテーマソング'
"""